{"gdp":{"code":"NY.GDP.MKTP.CD","max":14586736313339.0,"min":31350804.1281109,"name":"GDP (current US$)","description":"GDP at purchaser's prices is the sum of gross value added by all resident producers in the economy plus any product taxes and minus any subsidies not included in the value of the products. It is calculated without making deductions for depreciation of fabricated assets or for depletion and degradation of natural resources. Data are in current U.S. dollars. Dollar figures for GDP are converted from domestic currencies using single year official exchange rates. For a few countries where the official exchange rate does not reflect the rate effectively applied to actual foreign exchange transactions, an alternative conversion factor is used.","source":"World Development Indicators"},"gdp_per_capita":{"code":"NY.GDP.PCAP.CD","max":105437.670653056,"min":192.123813999542,"name":"GDP per capita (current US$)","description":"GDP per capita is gross domestic product divided by midyear population. GDP is the sum of gross value added by all resident producers in the economy plus any product taxes and minus any subsidies not included in the value of the products. It is calculated without making deductions for depreciation of fabricated assets or for depletion and degradation of natural resources. Data are in current U.S. dollars.","source":"World Development Indicators"},"gdp_growth_perc":{"code":"NY.GDP.MKTP.KD.ZG","max":26.3640783634058,"min":-5.19779953603425,"name":"GDP growth (annual %)","description":"Annual percentage growth rate of GDP at market prices based on constant local currency. Aggregates are based on constant 2000 U.S. dollars. GDP is the sum of gross value added by all resident producers in the economy plus any product taxes and minus any subsidies not included in the value of the products. It is calculated without making deductions for depreciation of fabricated assets or for depletion and degradation of natural resources.","source":"World Development Indicators"},"energy_production":{"code":"EG.EGY.PROD.KT.OE","max":1740906.878,"min":103.975,"name":"Energy production (kt of oil equivalent)","description":"Energy production refers to forms of primary energy--petroleum (crude oil, natural gas liquids, and oil from nonconventional sources), natural gas, solid fuels (coal, lignite, and other derived fuels), and combustible renewables and waste--and primary electricity, all converted into oil equivalents.","source":"World Development Indicators"},"energy_use":{"code":"EG.USE.COMM.KT.OE","max":2234994.871,"min":4204.806,"name":"Energy use (kt of oil equivalent)","description":"Energy use refers to use of primary energy before transformation to other end-use fuels, which is equal to indigenous production plus imports and stock changes, minus exports and fuels supplied to ships and aircraft engaged in international transport.","source":"World Development Indicators"},"gdp_per_energy_use":{"code":"EG.GDP.PUSE.KO.PP.KD","max":11.1809725484905,"min":1.94613243258348,"name":"GDP per unit of energy use (constant 2005 PPP $ per kg of oil equivalent)","description":"GDP per unit of energy use is the PPP GDP per kilogram of oil equivalent of energy use. PPP GDP is gross domestic product converted to 2005 constant international dollars using purchasing power parity rates. An international dollar has the same purchasing power over GDP as a U.S. dollar has in the United States.","source":"World Development Indicators"},"alternative_energy_perc":{"code":"EG.USE.COMM.CL.ZS","max":85.2475824791087,"min":0.389054810138684,"name":"Alternative and nuclear energy (% of total energy use)","description":"Clean energy is noncarbohydrate energy that does not produce carbon dioxide when generated. It includes hydropower and nuclear, geothermal, and solar power, among others.","source":"World Development Indicators"},"energy_imports_perc":{"code":"EG.IMP.CONS.ZS","max":97.5272343123559,"min":-562.95445638984,"name":"Energy imports, net (% of energy use)","description":"Net energy imports are estimated as energy use less production, both measured in oil equivalents. A negative value indicates that the country is a net exporter. Energy use refers to use of primary energy before transformation to other end-use fuels, which is equal to indigenous production plus imports and stock changes, minus exports and fuels supplied to ships and aircraft engaged in international transport.","source":"World Development Indicators"},"diesel_fuel_price":{"code":"EP.PMP.DESL.CD","max":2.03,"min":0.011,"name":"Pump price for diesel fuel (US$ per liter)","description":"Fuel prices refer to the pump prices of the most widely sold grade of diesel fuel. Prices have been converted from the local currency to U.S. dollars.","source":"World Development Indicators"},"road_sector_energy_use_perc":{"code":"IS.ROD.ENGY.ZS","max":62.2641509433962,"min":0.993258426966292,"name":"Road sector energy consumption (% of total energy consumption)","description":"Road sector energy consumption is the total energy used in the road sector including petroleum products, natural gas, electricity, and combustible renewable and waste. Total energy consumption is the total country energy consumption.","source":"World Development Indicators"},"electric_power_consumption_per_capita":{"code":"EG.USE.ELEC.KH.PC","max":51259.1876269627,"min":35.6844485044516,"name":"Electric power consumption (kWh per capita)","description":"Electric power consumption measures the production of power plants and combined heat and power plants less transmission, distribution, and transformation losses and own use by heat and power plants.","source":"World Development Indicators"},"co2_emisssions":{"code":"EN.ATM.CO2E.KT","max":7031916.207,"min":29.336,"name":"CO2 emissions (kt)","description":"Carbon dioxide emissions are those stemming from the burning of fossil fuels and the manufacture of cement. They include carbon dioxide produced during consumption of solid, liquid, and gas fuels and gas flaring.","source":"World Development Indicators"},"co2_emissions_per_capita":{"code":"EN.ATM.CO2E.PC","max":49.0505837857972,"min":0.022620457147677,"name":"CO2 emissions (metric tons per capita)","description":"Carbon dioxide emissions are those stemming from the burning of fossil fuels and the manufacture of cement. They include carbon dioxide produced during consumption of solid, liquid, and gas fuels and gas flaring.","source":"World Development Indicators"},"motor_vehicles_per_1000_people":{"code":"IS.VEH.NVEH.P3","max":863.0,"min":2.0,"name":"Motor vehicles (per 1,000 people)","description":"Motor vehicles include cars, buses, and freight vehicles but do not include two-wheelers. Population refers to midyear population in the year for which data are available.","source":"World Development Indicators"},"passenger_cars_per_1000_people":{"code":"IS.VEH.PCAR.P3","max":732.0,"min":1.0,"name":"Passenger cars (per 1,000 people)","description":"Passenger cars refer to road motor vehicles, other than two-wheelers, intended for the carriage of passengers and designed to seat no more than nine people (including the driver).","source":"World Development Indicators"},"urban_population":{"code":"SP.URB.TOTL","max":600896480.665643,"min":5116.544,"name":"Urban population","description":"Urban population refers to people living in urban areas as defined by national statistical offices. It is calculated using World Bank population estimates and urban ratios from the United Nations World Urbanization Prospects.","source":"World Development Indicators"},"urban_population_perc":{"code":"SP.URB.TOTL.IN.ZS","max":100.0,"min":11.0,"name":"Urban population (% of total)","description":"Urban population refers to people living in urban areas as defined by national statistical offices. It is calculated using World Bank population estimates and urban ratios from the United Nations World Urbanization Prospects.","source":"World Development Indicators"}}